numbers = {
	# 0 - 9
	"ноль": 0, "один": 1, "два": 2, "три": 3, "четыре": 4, 
	"пять": 5, "шесть": 6, "семь": 7, "восемь": 8, "девять": 9, 
	# 10 - 19
	"десять": 10, "одиннадцать": 11, "двенадцать": 12, "тринадцать": 13, 
	"четырнадцать": 14, "пятнадцать": 15, "шестнадцать": 16, 
	"семнадцать": 17, "восемнадцать": 18, "девятнадцать": 19, 
	# 20 - 90
	"двадцать": 20, "тридцать": 30, 
	"сорок": 40, "пятьдесят": 50, "шестьдесят": 60, 
	"семьдесят": 70, "восемьдесят": 80, "девяносто": 90,
	# 100 - 900
	"сто": 100, "двести": 200, "триста": 300,
	"четыреста": 400, "пятьсот": 500, "шестьсот": 600, 
	"семьсот": 700, "восемьсот": 800, "девятьсот": 900
}


def get_manifest() -> dict:
	return {
		"name": "Simple number normalizer",
		"version": "1.0",

		"numbers_normalizers": {
			"simple": text_to_number,
		}
	}

def text_to_number(text: str) -> int | None:
	if not text:
		return 
	words = text.lower().split()
	result = 0
	for w in words:
		if w in numbers:
			result += numbers[w]
	return result
